Autodesk.Revit.DB.Structure.LoadNature.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new LoadNature.
document:
The Document to which new load nature element will be added.
name:
The name of the load nature.
Returns:
The newly created load nature element if successful, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016